src/test/resources/XDS.b/RetrieveDocumentSetRequest_SOAP.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing">
  <!--The following header applies for a Synchronous Web Services Exchange Request 
        Please note that a soap message can only have one header section. -->
  <s:Header>
		<a:Action s:mustUnderstand="1">urn:ihe:iti:2007:RetrieveDocumentSet</a:Action>
		<a:MessageID>urn:uuid:0fbfdced-6c01-4d09-a110-2201afedaa02</a:MessageID>
		<a:ReplyTo>
			<a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
		</a:ReplyTo>
		<a:To s:mustUnderstand="1">http://localhost:2647/XdsService/IHEXDSRepository.svc</a:To>
	</s:Header>
  <!--The following DISABLED header applies for an Asynchronous Web Services Exchange Request 
        Please note that a soap message can only have one header section.
  <s:Header>
    <a:Action s:mustUnderstand="1">urn:ihe:iti:2008:RetrieveDocumentSetAsync</a:Action>
    <a:MessageID>urn:uuid:0fbfdced-6c01-4d09-a110-2201afedaa02</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://192.168.2.4:9080/XdsService/DocumentConsumerReceiver.svc</a:Address>
    </a:ReplyTo>
    <a:To s:mustUnderstand="1">http://localhost:2647/XdsService/IHEXDSRepository.svc</a:To>
  </s:Header>  -->
  <s:Body>
		<RetrieveDocumentSetRequest xsi:schemaLocation="urn:ihe:iti:xds-b:2007 ../../schema/IHE/XDS.b_DocumentRepository.xsd" xmlns="urn:ihe:iti:xds-b:2007" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
			<DocumentRequest>
				<RepositoryUniqueId>1.3.6.1.4...1000</RepositoryUniqueId>
				<DocumentUniqueId>1.3.6.1.4...2300</DocumentUniqueId>
			</DocumentRequest>
			<DocumentRequest>
				<RepositoryUniqueId>1.3.6.1.4...1000</RepositoryUniqueId>
				<DocumentUniqueId>1.3.6.1.4...2301</DocumentUniqueId>
			</DocumentRequest>
		</RetrieveDocumentSetRequest>
	</s:Body>
</s:Envelope>